InformationRegisters/ОбъявленияНаАвтохаб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОбъявленияНаАвтохаб</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>appraisal_id</Name>
					<Comment>Код сделки/оценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vehicle_id</Name>
					<Comment>Код объявления (автомобиля)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перемещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсмотрПроведен</Name>
					<Comment>Признак завершенного осмотра автомобиля</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

HTTPServices/AutoHub/Ext/Module.bsl
Функция WebhookPOST(Запрос)
	ЧтениеJSON = Новый ЧтениеJSON();
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	///////////////////////////////////////////////////////////////////////////////
	//тдТелоЗапроса = Новый ТекстовыйДокумент();
	//тдТелоЗапроса.ДобавитьСтроку(ТелоЗапроса);
	//ИмяФайла = "\\1cserver\Webhooks\Запрос_" + Формат(ТекущаяДата(),"ДФ=ггггММдд-ЧЧммсс") + ".txt";
	//тдТелоЗапроса.Записать(ИмяФайла);
	///////////////////////////////////////////////////////////////////////////////
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	Попытка
		стЗапрос = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Ответ = Новый HTTPСервисОтвет(415);
		Ответ.УстановитьТелоИзСтроки("Некорректный JSON в теле запроса!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецПопытки;
	
	Если стЗапрос.name = "maxposter.appraisal.updated" Тогда
		ЭтоОценка = Истина;
	ИначеЕсли стЗапрос.name = "maxposter.vehicle.updated" Тогда
		ЭтоОценка = Ложь;
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки("ok", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;
	
	payload = стЗапрос.payload;
	Если ТипЗнч(payload) <> Тип("Структура") Или обЗначениеНеЗаполнено(payload) Тогда
		Ответ = Новый HTTPСервисОтвет(422);
		Ответ.УстановитьТелоИзСтроки("Не указан payload в теле запроса!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;
	
	VIN = "";
	Если Не payload.Свойство("vin", VIN) Или обЗначениеНеЗаполнено(VIN) Тогда	
		Ответ = Новый HTTPСервисОтвет(422);
		Ответ.УстановитьТелоИзСтроки("Не указан vin в теле запроса!", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;
	
	ТекДата = ТекущаяДата(); 
	АвтомобильСсылка = Справочники.Автомобили.НайтиПоРеквизиту("VIN", VIN);
	Если обЗначениеНеЗаполнено(АвтомобильСсылка) Тогда
		АвтомобильОбъект = Справочники.Автомобили.СоздатьЭлемент();
		АвтомобильОбъект.VIN = VIN;
		АвтомобильОбъект.ДатаРегистрации = ТекДата;
		Попытка
			АвтомобильОбъект.Модель = ПолучитьМодель(payload.model.name, payload.brand.name);
		Исключение
		КонецПопытки;
		Попытка
			АвтомобильОбъект.Цвет = ПолучитьЦвет(payload.bodyColor);
		Исключение
		КонецПопытки;
		Попытка
			АвтомобильОбъект.ГодВыпуска = Дата(payload.year, 1, 1);
		Исключение
		КонецПопытки;
		
		АвтомобильОбъект.ФормированиеНаименованияАвтомобиля("");
		АвтомобильОбъект.Комментарий = "Создан автоматически на основании оценки в Автохаб";
		АвтомобильОбъект.УстановитьНовыйКод("ЦБ");
		
		АвтомобильОбъект.ОбменДанными.Загрузка = Истина;
		АвтомобильОбъект.Записать();
		АвтомобильСсылка = АвтомобильОбъект.Ссылка;
	КонецЕсли;
	
	Попытка
		Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(АвтомобильСсылка, payload.mileage,
			Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег, НачалоДня(ТекДата));
	Исключение
	КонецПопытки;
	
	мзОбъявлениеАвтохаб = РегистрыСведений.ОбъявленияНаАвтохаб.СоздатьМенеджерЗаписи();
	мзОбъявлениеАвтохаб.Автомобиль = АвтомобильСсылка;
	мзОбъявлениеАвтохаб.Прочитать();
	Если Не мзОбъявлениеАвтохаб.Выбран() Тогда
		мзОбъявлениеАвтохаб.Автомобиль = АвтомобильСсылка;
	КонецЕсли;
	
	Если ЭтоОценка Тогда
		Если мзОбъявлениеАвтохаб.appraisal_id <> payload.id Тогда
			мзОбъявлениеАвтохаб.appraisal_id = payload.id;
			мзОбъявлениеАвтохаб.ОсмотрПроведен = Ложь;
			мзОбъявлениеАвтохаб.Записать();
		КонецЕсли;
		
		Попытка
			КодОсмотра = payload.inspection.status.id;
			ДатаЗавершенияОсмотра = payload.inspection.finishedAt;
		Исключение
			КодОсмотра = 0;
		КонецПопытки;
		Если КодОсмотра = 4 Тогда
			мзОбъявлениеАвтохаб.ОсмотрПроведен = Истина;
			мзОбъявлениеАвтохаб.Записать();
			
			АвтомобильОбъект = АвтомобильСсылка.ПолучитьОбъект();
			АвтомобильОбъект.Комментарий = АвтомобильОбъект.Комментарий + "; Осмотр на Автохаб завершен " + ДатаЗавершенияОсмотра;
			АвтомобильОбъект.ОбменДанными.Загрузка = Истина;
			АвтомобильОбъект.Записать();
		КонецЕсли;
		
	ИначеЕсли мзОбъявлениеАвтохаб.vehicle_id <> payload.id И payload.Свойство("closedStatus") Тогда
		Если обЗначениеНеЗаполнено(payload.closedStatus) Тогда	
			мзОбъявлениеАвтохаб.vehicle_id = payload.id;
			мзОбъявлениеАвтохаб.ОсмотрПроведен = Истина;
			мзОбъявлениеАвтохаб.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтоОценка И ЗначениеЗаполнено(мзОбъявлениеАвтохаб.Поступление) Тогда
		Попытка
			Если payload.price > 0 Тогда
				ПоступлениеОбъект = мзОбъявлениеАвтохаб.Поступление.ПолучитьОбъект();
				СтрокаАвтомобиль = ПоступлениеОбъект.Автомобили[0];
				СтрокаАвтомобиль.СуммаПродажи = payload.price;
				ПоступлениеОбъект.ОбменДанными.Загрузка = Истина;
				ПоступлениеОбъект.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("ok", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции

Функция ПолучитьМодель(Модель, Марка)
	ШаблонНаименования = Марка + " " + Модель;
	Если обЗначениеНеЗаполнено(ШаблонНаименования) Тогда
		Возврат Справочники.Модели.ПустаяСсылка();
	КонецЕсли;
	
	ЗапросМодель = Новый Запрос();
	ЗапросМодель.УстановитьПараметр("Шаблон", "%" + ШаблонНаименования + "%");
	ЗапросМодель.Текст =
	"ВЫБРАТЬ
	|	Модели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Модели КАК Модели
	|ГДЕ
	|	Модели.Наименование ПОДОБНО &Шаблон";
	
	ВыборкаМодель = ЗапросМодель.Выполнить().Выбрать();
	Если ВыборкаМодель.Следующий() Тогда
		Возврат ВыборкаМодель.Ссылка;
	Иначе
		Возврат Справочники.Модели.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьЦвет(ШаблонЦвет)
	Если обЗначениеНеЗаполнено(ШаблонЦвет) Тогда
		Возврат Справочники.Цвета.ПустаяСсылка();
	КонецЕсли;
	
	ЗапросЦвет = Новый Запрос();
	ЗапросЦвет.УстановитьПараметр("Шаблон", "%" + ШаблонЦвет + "%");
	ЗапросЦвет.Текст =
	"ВЫБРАТЬ
	|	Цвета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Цвета КАК Цвета
	|ГДЕ
	|	Цвета.Наименование ПОДОБНО &Шаблон";
	
	ВыборкаЦвет = ЗапросЦвет.Выполнить().Выбрать();
	Если ВыборкаЦвет.Следующий() Тогда
		Возврат ВыборкаЦвет.Ссылка;
	Иначе
		Возврат Справочники.Цвета.ПустаяСсылка();
	КонецЕсли;
КонецФункции
